app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      if Artist.find_by_id(params[:artist_id])
        @songs = Artist.find_by_id(params[:artist_id]).songs
      else
        flash[:message] = "Artist not found."
        redirect_to artists_path
      end
    else
    @songs = Song.all